In [ ]:
# pandas was built on top of NumPy
# useful for data manipulation, organization, and modeling

# primary data structure is the Data Frame

In [4]:
import pandas as pd
import numpy as np

In [5]:
# Data Frame is like a NumPy Array
# has column names and row indexing

# can be created from csv files, database queries, explicitly

In [7]:
w = np.array([[0, 1, 2, 3], [4, 5, 6, 7]])

df = pd.DataFrame(w)

In [8]:
w

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [9]:
df

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [10]:
# can set column names and indexes during creation of DataFrame

df.columns = ['first', 'this', 'that', 'last']
df.index = ['row_1', 'row_2']

In [11]:
# with column names and indexes
df

       first  this  that  last
row_1      0     1     2     3
row_2      4     5     6     7

In [15]:
# alternative method
df = pd.DataFrame(w, columns=['set', 'with', 'the', 'args'], index=['row_1', 'row_2'])

In [16]:
df

       set  with  the  args
row_1    0     1    2     3
row_2    4     5    6     7

In [ ]:
Adding More Data

# df['COLUMN_NAME'] = [LIST_OF_VALUES]

In [17]:
names = ['George',
        'John',
        'Thomas',
        'James',
        'Andrew',
        'Martin',
        'William',
        'Zachary',
        'Millard',
        'Franklin']

# create an empty data frame with named rows
purchases = pd.DataFrame(index=names)

# add columns one at a time
purchases['country'] = ['US', 'CAN', 'CAN', 'US', 'CAN', 'US', 'US', 'US', 'CAN', 'US']
purchases['ad_views'] = [16, 42, 32, 13, 63, 19, 65, 23, 16, 77]
purchases['items_purchased'] = [2, 1, 0, 8, 0, 5, 7, 3, 0, 5]

In [18]:
purchases

         country  ad_views  items_purchased
George        US        16                2
John         CAN        42                1
Thomas       CAN        32                0
James         US        13                8
Andrew       CAN        63                0
Martin        US        19                5
William       US        65                7
Zachary       US        23                3
Millard      CAN        16                0
Franklin      US        77                5

In [19]:
# to grab info
# df.column_name and df['column_name'] both work
# bracket notation is preferred

In [24]:
# can set this to a new row
# purchases['items_purch_per_ad'] = purchases['items_purchased'] / purchases['ad_views']
purchases['items_purchased'] / purchases['ad_views']

George      0.125000
John        0.023810
Thomas      0.000000
James       0.615385
Andrew      0.000000
Martin      0.263158
William     0.107692
Zachary     0.130435
Millard     0.000000
Franklin    0.064935
dtype: float64

In [25]:
purchases['item_purch_per_ad']

George      0.125000
John        0.023810
Thomas      0.000000
James       0.615385
Andrew      0.000000
Martin      0.263158
William     0.107692
Zachary     0.130435
Millard     0.000000
Franklin    0.064935
Name: item_purch_per_ad, dtype: float64

In [26]:
purchases

         country  ad_views  items_purchased  item_purch_per_ad
George        US        16                2           0.125000
John         CAN        42                1           0.023810
Thomas       CAN        32                0           0.000000
James         US        13                8           0.615385
Andrew       CAN        63                0           0.000000
Martin        US        19                5           0.263158
William       US        65                7           0.107692
Zachary       US        23                3           0.130435
Millard      CAN        16                0           0.000000
Franklin      US        77                5           0.064935

# Pandas - Selecting and Grouping

In [34]:
# can call a specific column name

purchases['country']

George       US
John        CAN
Thomas      CAN
James        US
Andrew      CAN
Martin       US
William      US
Zachary      US
Millard     CAN
Franklin     US
Name: country, dtype: object

# selecting with .ix

In [30]:
# .ix is short for indexer
# indexes over rows and columns

# select index matching George
purchases.ix['George']

country                 US
ad_views                16
items_purchased          2
item_purch_per_ad    0.125
Name: George, dtype: object

In [33]:
# : works like a string slicer,selects all rows
purchases.ix[:, 'country']

George       US
John        CAN
Thomas      CAN
James        US
Andrew      CAN
Martin       US
William      US
Zachary      US
Millard     CAN
Franklin     US
Name: country, dtype: object

In [35]:
# can index by index and columns
purchases.ix['George', 'country']

'US'

In [72]:
# can use integer indexing
# 0 indexed along rows and columns
purchases.ix[3:5, 0:2]

       country  ad_views
James       US        13
Andrew     CAN        63

# Conditional selection with .ix

In [74]:
# lambda allows for creation of anonymous functions

purchases.ix[lambda df: purchases['items_purchased'] > 1, :]

# pass in df, return rows/indexes where items purchased is greater than 1 
# : means return all satisfying columns

         country  ad_views  items_purchased  item_purch_per_ad
George        US        16                2           0.125000
James         US        13                8           0.615385
Martin        US        19                5           0.263158
William       US        65                7           0.107692
Zachary       US        23                3           0.130435
Franklin      US        77                5           0.064935

In [57]:
# can just use boolean logic, but slightly less robust

purchases[purchases['items_purchased']>1]

         country  ad_views  items_purchased  item_purch_per_ad
George        US        16                2           0.125000
James         US        13                8           0.615385
Martin        US        19                5           0.263158
William       US        65                7           0.107692
Zachary       US        23                3           0.130435
Franklin      US        77                5           0.064935

# Groups

In [60]:
# can create groups in DataFrame using .groupby() method 
#      and passing in column name

purchases.groupby('country')

# if we want it to return something, we have to pass a 
#      second function call

In [61]:
# group by index(row)

purchases.groupby('country').mean()

# .sum()
# .count()
# .aggregate(numpy_function)

         ad_views  items_purchased  item_purch_per_ad
country
CAN         38.25             0.25           0.005952
US          35.50             5.00           0.217767